
        console.log('HI');
        console.log('HI2');

        // 작은따움표, 큰따움표 모두가능
        // 한 줄 주석

        /*
        여러 줄 주석
        */

        // console.log():괄호 안에 넣은 값을 출력

        console.log('hi 안녕 123 *^');

        // alert(): 브라우저 열렸을 때 알림창
        // alert('안녕?');

        // ;안써도 오류는 안나지만 하는게 좋다

        // prompt():사용자가 텍스트를 입력할 수 있도록 안내하는 대화 상자
        // ,user두번째값: 기본값으로 미리 떠있음
        // prompt('당신의 아이디는?', 'user');// 두번째 인자: input 창에 기본을 넣을 값

        //confirm(): 확인/취소  두 버튼을 갖는 대화 상자
        // confirm('오늘 점심 드시나요?');

